In [88]:
import numpy as np
import pandas as pd

In [89]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [90]:
# First 3 rows of the dataset:
df.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [91]:
#Last 3 rows of the Dataset:

df.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [92]:
# Display all the rows except last 02 rows of the dataset :

df.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [93]:
# all rows except the first rows :

df.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [94]:
# find the shape of the dataset:

df.shape

(7, 4)

In [95]:
df.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [97]:
# statistics about the dataset : [Only numerical columns]

df.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [98]:
# check null values:

df.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [99]:
df.describe(include = 'all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [100]:
# Unique values from Gender Column only :

df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [101]:
df['Email'].unique()

array(['priyang@gmail.com', 'aadhya@gmail.com', 'krisha@gmail.com',
       'vedant@yahoo.com', 'parshv@hotmail.com', 'mittal@yahoo.com',
       'archana@yahoo.com'], dtype=object)

In [102]:
# find the number of Unique values from Email column :

df['Email'].nunique()

7

In [103]:
df.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [104]:
# Handle the missing values :

df.dropna()

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [105]:
df.fillna(1)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    1.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    1.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [106]:
df['Marks'] = df['Marks'].fillna(df['Marks'].mean())

In [107]:
# Display the marks between 80 - 90 

sum(df['Marks'].between(80,90))

2

In [108]:
# Name of the students with lowest marks :

df['Marks'].min()

83.0

In [109]:
df[df['Marks'].min() == df['Marks']]

     Name  Marks  Gender             Email
5  Mittal   83.0  Female  mittal@yahoo.com

In [110]:
df[df['Marks'].max() == df['Marks']]

      Name  Marks  Gender              Email
2   Krisha   99.0  Female   krisha@gmail.com
6  Archana   99.0  Female  archana@yahoo.com

In [111]:
df[df['Marks'].max() == df['Marks']] ['Name']

2     Krisha
6    Archana
Name: Name, dtype: object

In [112]:
# Top 5 students by their marks :

df.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [113]:
df.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
5   Mittal   83.0  Female    mittal@yahoo.com

In [114]:
df.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [115]:
# Apply method:

def marks(x):
  return x/2

df['Half_marks'] = df['Marks'].apply(marks)

In [116]:
df

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5